Script started on Wed 07 May 2014 11:23:19 PM PDT
You are currently using 0% (585.0 KiB) of your 488.3 MiB quota.
]0;uzahid@unix1:lab5[uzahid@unix1 lab5]$ mk list2[K1.[K[K2.c
CSOURCE=environ.c EXECBIN=environ
+ cid + environ.c
+ checksource environ.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 environ.c -o environ -lm
+ tee environ.c.log
environ.c:7:6: warning: return type of â€˜mainâ€™ is not â€˜intâ€™ [-Wmain]
 void main () {
      ^
environ.c: In function â€˜mainâ€™:
environ.c:11:4: warning: â€˜returnâ€™ with a value, in function returning void [enabled by default]
    return EXIT_SUCCESS;
    ^
+ set +x
============================================================
CSOURCE=list1.c EXECBIN=list1
+ cid + list1.c
+ checksource list1.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list1.c -o list1 -lm
+ tee list1.c.log
list1.c: In function â€˜mainâ€™:
list1.c:15:7: warning: implicit declaration of function â€˜mallocâ€™ [-Wimplicit-function-declaration]
       node *node = malloc (sizeof (struct node));
       ^
list1.c:15:20: warning: incompatible implicit declaration of built-in function â€˜mallocâ€™ [enabled by default]
       node *node = malloc (sizeof (struct node));
                    ^
list1.c:12:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
+ tee list2.c.log
list2.c: In function â€˜mainâ€™:
list2.c:13:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
CSOURCE=list3.c EXECBIN=list3
+ cid + list3.c
+ checksource list3.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list3.c -o list3 -lm
+ tee list3.c.log
+ set +x
============================================================
CSOURCE=list4.c EXECBIN=list4
+ cid + list4.c
+ checksource list4.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list4.c -o list4 -lm
+ tee list4.c.log
+ set +x
============================================================
CSOURCE=malloc.c EXECBIN=malloc
+ cid + malloc.c
+ checksource malloc.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 malloc.c -o malloc -lm
+ tee malloc.c.log
malloc.c: In function â€˜mainâ€™:
malloc.c:12:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
malloc.c:12:28: warning: unused parameter â€˜argvâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
                            ^
+ set +x
============================================================
CSOURCE=uninit.c EXECBIN=uninit
+ cid + uninit.c
+ checksource uninit.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 uninit.c -o uninit -lm
+ tee uninit.c.log
uninit.c: In function â€˜mainâ€™:
uninit.c:6:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
uninit.c:6:28: warning: unused parameter â€˜argvâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
                            ^
uninit.c:8:11: warning: â€˜pointerâ€™ is used uninitialized in this function [-Wuninitialized]
    printf ("pointer=%p\n", pointer);
           ^
uninit.c:11:11: warning: â€˜fooâ€™ is used uninitialized in this function [-Wuninitialized]
    printf ("foo=%d\n", foo);
           ^
+ set +x
============================================================
]0;uzahid@unix1:lab5[uzahid@unix1 lab5]$ valgrind list2 foo bar
==14892== Memcheck, a memory error detector
==14892== Copyright (C) 2002-2012, and GNU GPL'd, by Julian Seward et al.
==14892== Using Valgrind-3.8.1 and LibVEX; rerun with -h for copyright info
==14892== Command: list2 foo bar
==14892== 
0x4c28180->node {word=0x7ff000221->[USER=uzahid], link=0x4c28130}
0x4c28130->node {word=(nil)->[(null)], link=0x4c280e0}
0x4c280e0->node {word=0x7ff00021d->[bar], link=0x4c28090}
0x4c28090->node {word=0x7ff000219->[foo], link=0x4c28040}
==14892== Conditional jump or move depends on uninitialised value(s)
==14892==    at 0x400682: main (list2.c:22)
==14892== 
==14892== 
==14892== HEAP SUMMARY:
==14892==     in use at exit: 80 bytes in 5 blocks
==14892==   total heap usage: 5 allocs, 0 frees, 80 bytes allocated
==14892== 
==14892== LEAK SUMMARY:
==14892==    definitely lost: 16 bytes in 1 blocks
==14892==    indirectly lost: 64 bytes in 4 blocks
==14892==      possibly lost: 0 bytes in 0 blocks
==14892==    still reachable: 0 bytes in 0 blocks
==14892==         suppressed: 0 bytes in 0 blocks
==14892== Rerun with --leak-check=full to see details of leaked memory
==14892== 
==14892== For counts of detected and suppressed errors, rerun with: -v
==14892== Use --track-origins=yes to see where uninitialised values come from
==14892== ERROR SUMMARY: 1 errors from 1 contexts (suppressed: 6 from 6)
]0;uzahid@unix1:lab5[uzahid@unix1 lab5]$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/h/uzahid/private/cmps012b/lab5/list2...done.
(gdb) break 26
Breakpoint 1 at 0x400684: file list2.c, line 26.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/h/uzahid/private/cmps012b/lab5/list2 foo bar
warning: Skipping deprecated .gdb_index section in /usr/lib/debug/lib64/ld-2.12.so.debug.
Do "set use-deprecated-index-sections on" before the file is read
to use the section anyway.
0x601090->node {word=0x7fffffffe0c1->[USER=uzahid], link=0x601070}
0x601070->node {word=(nil)->[(null)], link=0x601050}
0x601050->node {word=0x7fffffffe0bd->[bar], link=0x601030}
0x601030->node {word=0x7fffffffe0b9->[foo], link=0x601010}

Breakpoint 1, main (argc=3, argv=0x7fffffffdda8) at list2.c:26
26	   return 9;
(gdb) where
#0  main (argc=3, argv=0x7fffffffdda8) at list2.c:26
(gdb) list 
21	   }
22	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
23	      printf ("%p->node {word=%p->[%s], link=%p}\n",
24	              curr, curr->word, curr->word, curr->link);
25	   }
26	   return 9;
27	}
(gdb) list list2.c:23
18	      node->word = argv[argi];
19	      node->link = head;
20	      head = node;
21	   }
22	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
23	      printf ("%p->node {word=%p->[%s], link=%p}\n",
24	              curr, curr->word, curr->word, curr->link);
25	   }
26	   return 9;
27	}
(gdb) print head
$1 = (node *) 0x601090
(gdb) bt
#0  main (argc=3, argv=0x7fffffffdda8) at list2.c:26
(gdb) print head
$2 = (node *) 0x601090
(gdb) print *head
$3 = {word = 0x7fffffffe0c1 "USER=uzahid", link = 0x601070}
(gdb) print *(head->word)
$4 = 85 'U'
(gdb) print head->link->link->link
$5 = (node *) 0x601030
(gdb) print *(head->link->link->link)
$6 = {word = 0x7fffffffe0b9 "foo", link = 0x601010}
(gdb) exit
Undefined command: "exit".  Try "help".
(gdb) quit
A debugging session is active.

	Inferior 1 [process 14897] will be killed.

Quit anyway? (y or n) y
]0;uzahid@unix1:lab5[uzahid@unix1 lab5]$ exit
exit

Script done on Wed 07 May 2014 11:25:01 PM PDT
